# 作者: 余殷博
# cangj87@gmail.com
import re

text = """
<div>
<p>武汉大学数学与统计学院教师招聘启事</p>
<p><br></p>

<p>武汉大学数学与统计学院诚聘教师</p>
<p><br></p>

<p>发布机构：</p>
<p>武汉大学数学与统计学院</p>
<p><br></p>

<p>招聘岗位：</p>
<p>数学与统计学院专任教师</p>
<p><br></p>

<p>招聘人数：</p>
<p>若干名</p>
<p><br></p>

<p>工作地点：</p>
<p>湖北省武汉市武昌区珞珈山</p>
<p><br></p>

<p>岗位职责：</p>
<p>负责本科及研究生课程教学工作，参与科研项目与学术活动。</p>
<p><br></p>

<p>任职条件：</p>
<p>1、具有博士学位，优秀博士应届毕业生可适当放宽条件。</p>
<p>2、在数学、统计学或相关交叉学科具有扎实的研究基础与发展潜力。</p>
<p>3、有良好的科研发表能力和团队协作精神。</p>
<p><br></p>

<p>薪资待遇：</p>
<p>面议（提供科研启动经费及住房补贴）</p>
<p><br></p>

<p>联系方式：</p>
<p>联系人：李老师</p>
<p>邮箱：mathstat_hr@whu.edu.cn</p>
<p>电话：027‑68755321</p>
<p><br></p>

<p>应聘方式：</p>
<p>请将个人简历、代表性论文、教学计划等资料发送至上述邮箱。</p>
<p><br></p>

<p>发布日期：</p>
<p>2025/09/01</p>
<p><br></p>

<p>截止日期：</p>
<p>2025/11/30</p>
<p><br></p>
</div>
"""

# 提取其中的文本
ret = re.sub(r"<[^>]*>|\n", "\n", text)
# 删除所有tag换成换行
ret = re.sub(r'\n{2,}', r'\n', ret)
# 去掉多余换行
print(ret)

# 使用split
ret = re.split(r', |\. | ', 'Wendy is a girl, she is 18 years old.'
                            ' She is also a great programmer!')
# 按照上述的符号进行分割
print(ret)
